#Задача 34: Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. Поскольку
#разобраться в его кричалках не настолько просто, насколько легко он их придумывает, Вам
#стоит написать программу. Винни-Пух считает, что ритм есть, если число слогов (т.е. число
#гласных букв) в каждой фразе стихотворения одинаковое. Фраза может состоять из одного
#слова, если во фразе несколько слов, то они разделяются дефисами. Фразы отделяются друг
#от друга пробелами. Стихотворение Винни-Пух вбивает в программу с клавиатуры. В ответе
#напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, если с ритмом все не в порядке
#Ввод: Вывод:
#пара-ра-рам рам-пам-папам па-ра-па-дам Парам пам-пам

list_1 ='пара-ра-рам рам-пам-папам па-ра-па-дам'.split()

count = str(list_1[0]).count('а')
Flag=True

for i in range(1, len(list_1)):
    if Flag==True:
        if str(list_1[i]).count('а') == count:
            i = i+1
            if i == len(list_1):
                print ('Парам пам-пам')
        else:
            print ('Пам парам')
            Flag = False

    

        

